icoFsiElasticNonLinULSolidFoam/TestCaseFSI-V1.6ext/fluid/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices        
(
    (0 0 0)	//0
    (9 0 0)
    (9 15 0)
    (0 15 0)
    (0 0 0.1)
    (9 0 0.1)	//5
    (9 15 0.1)
    (0 15 0.1)
    (9 8 0)
    (11 8 0)
    (11 15 0)	//10
    (9 8 0.1)
    (11 8 0.1)
    (11 15 0.1)
    (11 0 0)
    (20 0 0)	//15
    (20 15 0)
    (11 0 0.1)
    (20 0 0.1)
    (20 15 0.1)
    (0 8 0)	//20
    (20 8 0)
    (0 8 0.1)
    (20 8 0.1)
);

blocks          
(
    hex (0 1 8 20 4 5 11 22) (18 16 1) simpleGrading (1 1 1)
    hex (20 8 2 3 22 11 6 7) (18 14 1) simpleGrading (1 1 1)
    hex (8 9 10 2 11 12 13 6) (4 14 1) simpleGrading (1 1 1)
    hex (9 21 16 10 12 23 19 13) (18 14 1) simpleGrading (1 1 1)
    hex (14 15 21 9 17 18 23 12) (18 16 1) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    patch inlet 
    (
        (0 4 22 20)
        (20 22 7 3)
    )
    patch outlet
    (
        (15 21 23 18)
        (21 16 19 23)
    )
    patch tailFluid
    (
        (1 5 11 8)
        (8 11 12 9)
        (14 9 12 17)
    )
    wall topWall
    (
        (3 7 6 2)
        (2 6 13 10)
        (10 13 19 16)
    )
    wall bottomWall
    (
        (0 1 5 4)
        (14 15 18 17)
    )
    empty frontAndBack 
    (
        (0 20 8 1)
        (20 3 2 8)
        (8 2 10 9)
        (9 10 16 21)
        (14 9 21 15)
        (4 5 11 22)
        (22 11 6 7)
        (11 12 13 6)
        (12 23 19 13)
        (17 18 23 12)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
