icoFsiElasticNonLinULSolidFoam/TestCaseFSI-V1.6ext/fluid/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version	    2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          fvSchemes;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;  //HronTurek tutorial uses backward;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
//below copied from HronTurek tutorial
//    default         none;
//    grad(p) Gauss linear;
//    snGradCorr(U) Gauss linear;
//    grad(U) Gauss linear;
//    snGradCorr(p) Gauss linear;
//    snGradCorr(cellMotionU) Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linear;	//HronTurek tutorial uses: Gauss skewCorrected linear;
    div(phi,T)      Gauss linear;
}

laplacianSchemes
{
    default         none;
    laplacian(nu,U) Gauss linear corrected;
    laplacian((1|A(U)),p) Gauss linear corrected;
//HronTurek has another line here:     laplacian(diffusivity,cellMotionU) Gauss linear corrected;
    laplacian(DT,T) Gauss linear corrected;

}

interpolationSchemes
{
    default         linear;
    interpolate(HbyA) linear;
//below copied from HronTurek tutorial
//    default           none;
//    interpolate(y) linear;
//    interpolate(U) skewCorrected linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p;
}

// ************************************************************************* //
